import {nanoid} from "nanoid";

export const historyList = [
    {
        id: 'today',
        name: "今天",
        children: [
            {
                id: '01',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            }
        ]
    },
    {
        id: 'yesterday',
        name: "昨天",
        children: [
            {
                id: '02',
                name: "请问你的谁的谁",
            },
            {
                id: '03',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '04',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '05',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '06',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '07',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '08',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '09',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
        ]
    },
    {
        id: 'lastday',
        name: "7天以前",
        children: [
            {
                id: '10',
                name: "请问你的谁的谁",
            },
            {
                id: '11',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '12',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '13',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '14',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '15',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '16',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
            {
                id: '17',
                name: "请问你的谁的谁,请问你的谁的谁,请问你的谁的谁",
            },
        ]
    }
]